<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use DB;
class TestsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('tests')->insert(array(
            0 => array(
                'name' => 'سدیم',
                'en_name' => 'NA',
                'description' => '',
                'high' => '145',
                'low' => '136',
                'estimate' => 1,
                'price' => 10000,
                'expertise_code' => 200023
            ),
            1 => array(
                'name' => 'پتاسیم',
                'en_name' => 'K',
                'description' => '',
                'high' => '5',
                'low' => '3.5',
                'estimate' => 1,
                'price' => 12000,
                'expertise_code' => 200023
            ),
            2 => array(
                'name' => 'اوره',
                'en_name' => 'Urea',
                'description' => 'Urea',
                'high' => '6.4',
                'low' => '2.5',
                'estimate' => 2,
                'price' => 20000,
                'expertise_code' => 200022
            ),
            3 => array(
                'name' => 'کراتینین',
                'en_name' => 'Creatinine',
                'description' => '',
                'high' => '1.3',
                'low' => '0.6',
                'estimate' => 2,
                'price' => 30000,
                'expertise_code' => 200023
            ),
            4 => array(
                'name' => 'قند خون',
                'en_name' => 'FBS',
                'description' => 'حداقل 8 ساعت ناشتایی قبل از آزمایش قند خون رعایت شود
        – ترجیحا تا قبل ازساعت 9 صبح برای نمونه گیری اقدام فرمایید',
                'high' => '126',
                'low' => '100',
                'estimate' => 3,
                'price' => '50000',
                'expertise_code' => 200021
            ),
            5 => array(
                'name' => 'هموگلوبین گلیکوزیله',
                'en_name' => 'HbA1c',
                'description' => '',
                'high' => '120',
                'low' => '70',
                'estimate' => 2,
                'price' => 27000,
                'expertise_code' => 200021
            ),
            6 => array(
                'name' => 'تری گلیسرید',
                'en_name' => 'Triglycerides',
                'description' => '',
                'high' => '249',
                'low' => '150',
                'estimate' => 3,
                'price' => 25000,
                'expertise_code' => 200021
            ),
            7 => array(
                'name' => 'کلسترول',
                'en_name' => 'Cholesterol',
                'description' => ' برای مدت ۱۲ ساعت قبل از نمونه‌گیری ناشتا باشید. (مصرف آب در این مدت بلامانع است)
        اگر سابقه‌ی مصرف داروهای زیر را دارید و یا درصورت مصرف هرنوع داروی دیگر، حتماً پذیرش را مطلع سازید:
        آمیودارون، لووتیروکسین، لوودوپا، سوتالول، اسبوتولول، وراپامیل، آمیلوراید، ترازوسین، انالاپریل، کورتیکواستروئیدها، آندروژن ها، دانازول، نافارلین، داروهای ضدبارداری های خوراکی، کاتکول آمین ها، دیکلوفناک، ایبوپروفن، نئومایسین، لوواستاتین، ایزوترتینوئین، اکسی متالون، فنوباربیتال، فنوتیازین، اسید آسکوربیک، نیاسین، آمینوسالیسیلیک اسید، دی سولفیرام
        به مدت ۲۴ ساعت قبل از آزمایش از انجام ورزش سنگین و استعمال دخانیات اجتناب کنید',
                'high' => '240',
                'low' => '200',
                'estimate' => 3,
                'price' => 40000,
                'expertise_code' => 200021
            ),
            8 => array(
                'name' => 'کلسترول لیپوپروتئین با چگالی کم',
                'en_name' => 'LDL',
                'description' => ' برای مدت ۱۲ ساعت قبل از نمونه‌گیری ناشتا باشید. (مصرف آب در این مدت بلامانع است)
        اگر سابقه‌ی مصرف داروهای زیر را دارید و یا درصورت مصرف هرنوع داروی دیگر، حتماً پذیرش را مطلع سازید:
        آمیودارون، لووتیروکسین، لوودوپا، سوتالول، اسبوتولول، وراپامیل، آمیلوراید، ترازوسین، انالاپریل، کورتیکواستروئیدها، آندروژن ها، دانازول، نافارلین، داروهای ضدبارداری های خوراکی، کاتکول آمین ها، دیکلوفناک، ایبوپروفن، نئومایسین، لوواستاتین، ایزوترتینوئین، اکسی متالون، فنوباربیتال، فنوتیازین، اسید آسکوربیک، نیاسین، آمینوسالیسیلیک اسید، دی سولفیرام
        به مدت ۲۴ ساعت قبل از آزمایش از انجام ورزش سنگین و استعمال دخانیات اجتناب کنید',
                'high' => '190',
                'low' => '100',
                'estimate' => 5,
                'price' => 20000,
                'expertise_code' => 200021
            ),
            9 => array(
                'name' => 'کلسترول لیپوپروتئین با چگالی بالا',
                'en_name' => 'HDL',
                'description' => ' برای مدت ۱۲ ساعت قبل از نمونه‌گیری ناشتا باشید. (مصرف آب در این مدت بلامانع است)
        اگر سابقه‌ی مصرف داروهای زیر را دارید و یا درصورت مصرف هرنوع داروی دیگر، حتماً پذیرش را مطلع سازید:
        آمیودارون، لووتیروکسین، لوودوپا، سوتالول، اسبوتولول، وراپامیل، آمیلوراید، ترازوسین، انالاپریل، کورتیکواستروئیدها، آندروژن ها، دانازول، نافارلین، داروهای ضدبارداری های خوراکی، کاتکول آمین ها، دیکلوفناک، ایبوپروفن، نئومایسین، لوواستاتین، ایزوترتینوئین، اکسی متالون، فنوباربیتال، فنوتیازین، اسید آسکوربیک، نیاسین، آمینوسالیسیلیک اسید، دی سولفیرام
        به مدت ۲۴ ساعت قبل از آزمایش از انجام ورزش سنگین و استعمال دخانیات اجتناب کنید',
                'high' => '60',
                'low' => '40',
                'estimate' => 5,
                'price' => 20000,
                'expertise_code' => 200021
            ),
            10 => array(
                'name' => 'تیروکسین',
                'en_name' => 'T4',
                'description' => '',
                'high' => '12',
                'low' => '5',
                'estimate' => 4,
                'price' => 50000,
                'expertise_code' => 200020
            ),
            11 => array(
                'name' => 'تری یدوتیرونین',
                'en_name' => 'T3',
                'description' => '',
                'high' => '4',
                'low' => '2',
                'estimate' => 2,
                'price' => 35000,
                'expertise_code' => 200020
            ),
            12 => array(
                'name' => 'تیروئید',
                'en_name' => 'TSH',
                'description' => 'بهتر است زمان انجام آزمایش صبح باشد.
        در صورت مصرف هر گونه دارو پزشک معالج خود را آگاه سازید.
        طی یک هفته قبل از انجام آزمایش از مصرق قرص ویتامین خودداری کنید.
        در حدود 8 الی 12 ساعت قبل از انجام آزمایش از کشیدن سیگار بپرهیزید.
        در آزمایش تیروئید ملزم به رعایت ناشتایی نمی باشید اما چون مواد غذایی چرب روی جواب آزمایش تاثیر میگذارد حداقل سه ساعت قبل انجام آزمایش از خوردن مواد غذایی چرب بپرهیزید.
         در صورت مبتلا به سرما خوردگی و آنفولانزا تا زمان بهبودی کاملا از انجام آزمایش تیروئید بپرهیزید.
        در صورت مصرف قرص تیروکسین فقط  در روز آزمایش از خوردن آن خودداری کنید.',
                'high' => '3',
                'low' => '5',
                'estimate' => 2,
                'price' => 35000,
                'expertise_code' => 200020
            ),

        ));

    }
}
